   export const diseaseGuidelines = {
    diabetes: [
        "اتباع نظام غذائي صحي منخفض الكربوهيدرات.",
        "مراقبة مستويات السكر في الدم بانتظام.",
        "ممارسة التمارين الرياضية بانتظام لتحسين حساسية الأنسولين.",
        "تناول الأدوية الموصوفة من الطبيب بانتظام.",
        "تجنب المشروبات السكرية واستبدالها بالماء أو الشاي الأخضر.",
        "زيارة الطبيب بشكل دوري لإجراء الفحوصات اللازمة."
    ],
    bloodPressure: [
        "تقليل استهلاك الملح في الطعام.",
        "الحفاظ على وزن صحي وممارسة الرياضة بانتظام.",
        "الابتعاد عن الأطعمة المعلبة التي تحتوي على كميات كبيرة من الصوديوم.",
        "الإقلاع عن التدخين إذا كنت مدخنًا.",
        "تقليل التوتر من خلال ممارسة التأمل أو اليوغا.",
        "شرب الماء بانتظام والابتعاد عن المشروبات الغازية."
    ],
    cardiovascular: [
        "تناول الأطعمة الغنية بالألياف والخضروات الورقية لتحسين صحة القلب.",
        "ممارسة التمارين الهوائية مثل المشي أو السباحة بانتظام.",
        "تجنب تناول الأطعمة الغنية بالدهون المشبعة والمهدرجة.",
        "الحفاظ على مستويات ضغط الدم والكوليسترول في النطاق الطبيعي.",
        "تجنب التدخين والتعرض للتدخين السلبي.",
        "الحد من استهلاك الكافيين والمشروبات الكحولية."
    ],
    joint: [
        "استخدام الكمادات الباردة أو الدافئة لتخفيف التورم والألم.",
        "ممارسة تمارين تقوية العضلات المحيطة بالمفصل المصاب.",
        "الابتعاد عن حمل الأشياء الثقيلة لتقليل الضغط على المفصل.",
        "استخدام دعامة طبية عند الحاجة لتثبيت المنطقة المصابة.",
        "تناول الأدوية المضادة للالتهابات بناءً على توصية الطبيب.",
        "زيارة الطبيب عند استمرار الألم أو التورم لفترة طويلة."
    ],
    immunology: [
        "الحفاظ على نظام غذائي صحي غني بالخضروات والفواكه.",
        "مراقبة أي علامات تدل على نوبات أو تدهور في الحالة الصحية.",
        "تجنب التعرض للمثيرات مثل الإجهاد البدني أو العاطفي.",
        "تناول الأدوية المثبطة للالتهاب مثل الكولشيسين بناءً على وصف الطبيب.",
        "شرب كمية كافية من الماء يوميًا للحفاظ على الترطيب.",
        "زيارة الطبيب بشكل دوري لمتابعة الحالة الصحية وإجراء التحاليل."
    ],
    general: [
        "اتباع نظام غذائي صحي يحتوي على الخضروات والفواكه الطازجة.",
        "ممارسة الرياضة بانتظام لمدة 30 دقيقة يوميًا.",
        "الحفاظ على وزن صحي ومراقبة أي تغيرات غير مبررة.",
        "زيارة الطبيب بشكل دوري لإجراء الفحوصات الروتينية."
    ]
};