export const questions = {

    InternalDiseases
        : {
        diabetes: [
            { text: "هل تعاني من صداع متكرر؟", points: 5 },
            { text: "هل شعرت يومًا بدوار أو دوخة عند الوقوف فجأة؟", points: 5 },
            { text: "هل لديك تاريخ عائلي بمرض السكري؟", points: 15 },
            { text: "هل تعاني من زيادة الوزن؟", points: 10 },
            { text: "هل لاحظت تسارع أو عدم انتظام في ضربات قلبك؟", points: 10 },
            { text: "هل تعاني من صعوبة في التنفس بعد القيام بمجهود بسيط؟", points: 10 },
            { text: "هل تشعر بالعطش الشديد بشكل غير طبيعي؟", points: 10 },
            { text: "هل تعاني من كثرة التبول؟", points: 10 },
            { text: "هل لاحظت جفاف في الفم أو الحلق؟", points: 10 },
            { text: "هل تجد صعوبة في التئام الجروح أو الشفاء منها؟", points: 15 }
        ]
        ,
        bloodPressure: [
            { text: "هل لديك تاريخ عائلي بمرض ارتفاع أو انخفاض ضغط الدم؟", points: 10 },
            { text: "هل لاحظت تسارع أو عدم انتظام في ضربات قلبك؟", points: 15 },
            { text: "هل تشعر بألم أو ضغط في منطقة الصدر؟", points: 20 },
            { text: "هل لاحظت وجود تورم في القدمين أو الكاحلين مؤخرًا؟", points: 10 },
            { text: "هل شعرت بإجهاد شديد أو ضعف دون سبب واضح؟", points: 10 },
            { text: "هل لديك تاريخ عائلي لأمراض القلب أو الجلطات؟", points: 15 },
            { text: "هل تعاني من صداع مستمر أو متكرر؟", points: 10 },
            { text: "هل شعرت بدوخة أو فقدان التوازن عند الوقوف؟", points: 10 },
            { text: "هل تجد صعوبة في التنفس عند بذل جهد بسيط؟", points: 10 },
            { text: "هل لديك تاريخ عائلي بالسكتات الدماغية؟", points: 15 }
        ]

    },
    cardiovascular: [
        { text: "هل لديك تاريخ عائلي بمرض ارتفاع أو انخفاض ضغط الدم؟", points: 10 },
        { text: "هل لاحظت تسارع أو عدم انتظام في ضربات قلبك؟", points: 15 },
        { text: "هل تشعر بألم أو ضغط في منطقة الصدر؟", points: 20 },
        { text: "هل لاحظت وجود تورم في القدمين أو الكاحلين مؤخرًا؟", points: 10 },
        { text: "هل شعرت بإجهاد شديد أو ضعف دون سبب واضح؟", points: 10 },
        { text: "هل لديك تاريخ عائلي لأمراض القلب أو الجلطات؟", points: 15 },
    ],
    joint: [
        { text: "هل تعرضت لسقوط أو حادث مؤخرًا؟", points: 10 },
        { text: "هل شعرت بألم شديد عند الضغط على مكان الإصابة؟", points: 15 },
        { text: "هل هناك انتفاخ أو تورم في المنطقة المصابة؟", points: 10 },
        { text: "هل لاحظت أي تغير في شكل العظام أو المفصل في المنطقة المصابة؟", points: 20 },
        { text: "هل تجد صعوبة في تحريك الجزء المصاب؟", points: 10 },
    ]
    ,
    immunology: [
        { text: "هل تعاني من نوبات متكررة من الحمى التي تستمر يومًا إلى ثلاثة أيام؟", points: 10 },
        { text: "هل شعرت بألم شديد في البطن خلال تلك النوبات؟", points: 15 },
        { text: "هل تعاني من ألم أو تورم في المفاصل أثناء النوبات أو بعدها؟", points: 10 },
        { text: "هل تلاحظ ظهور طفح جلدي أحمر على الساقين، خاصة حول الكاحل؟", points: 15 },
        { text: "هل سبق أن شعرت بألم في الصدر يزداد مع التنفس العميق خلال النوبات؟", points: 10 },
        { text: "هل لديك تاريخ عائلي لأشخاص يعانون من نفس الأعراض أو تم تشخيصهم بحمى البحر المتوسط؟", points: 20 },
        { text: "هل تزداد الأعراض سوءًا عند التعرض للتوتر أو الجهد البدني؟", points: 10 },
        { text: "هل تختفي الأعراض لديك تمامًا بين النوبات؟", points: 5 },
        { text: "هل لاحظت أنك تشعر بتحسن عند استخدام الكولشيسين (Colchicine)؟", points: 20 },
        { text: "هل أظهرت الفحوصات السابقة ارتفاعًا في مؤشرات الالتهاب مثل ESR أو CRP أثناء النوبات؟", points: 15 }
    ]

};